Tekla Open API Reference for Tekla Structures 2025
Events.ModelSaveInfo Event
 The ModelSave event is raised just after a model has been saved with the model save information as a string parameter.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ModelSaveInfoDelegate ModelSaveInfo
Public Event ModelSaveInfo As Events.ModelSaveInfoDelegate
Value
Type: Tekla.Structures.Model.Events.ModelSaveInfoDelegate
Implements
IEvents.ModelSaveInfo
See Also
Reference
Events Class
Tekla.Structures.Model Namespace